/*
This file is part of Telegram Desktop,
the official desktop version of Telegram messaging app, see https://telegram.org

Telegram Desktop is free software: you can redistribute it and/or modify
it under the terms of the GNU General Public License as published by
the Free Software Foundation, either version 3 of the License, or
(at your option) any later version.

It is distributed in the hope that it will be useful,
but WITHOUT ANY WARRANTY; without even the implied warranty of
MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the
GNU General Public License for more details.

In addition, as a special exception, the copyright holders give permission
to link the code of portions of this program with the OpenSSL library.

Full license: https://github.com/telegramdesktop/tdesktop/blob/master/LICENSE
Copyright (c) 2014-2015 John Preston, https://desktop.telegram.org
*/
"lng_language_name" = "Русский";
"lng_switch_to_this" = "Переключиться на русский";

"lng_menu_contacts" = "Контакты";
"lng_menu_settings" = "Настройки";
"lng_menu_about" = "О программе";
"lng_menu_update" = "Обновить";
"lng_menu_restart" = "Перезапустить";
"lng_menu_back" = "Назад";

"lng_disable_notifications_from_tray" = "Отключить уведомления";
"lng_enable_notifications_from_tray" = "Включить уведомления";
"lng_open_from_tray" = "Открыть Telegram";
"lng_minimize_to_tray" = "Свернуть в трей";
"lng_quit_from_tray" = "Выйти  из Telegram";
"lng_tray_icon_text" = "Telegram до сих пор запущен, \nвы можете настроить это на странице настроек. \nЕсли эта иконка пропадёт из трея, вы можете \nперетащить её сюда снова из скрытых иконок.";

"lng_month1" = "Января";
"lng_month2" = "Февраля";
"lng_month3" = "Марта";
"lng_month4" = "Апреля";
"lng_month5" = "Мая";
"lng_month6" = "Июня";
"lng_month7" = "Июля";
"lng_month8" = "Августа";
"lng_month9" = "Сентября";
"lng_month10" = "Октября";
"lng_month11" = "Ноября";
"lng_month12" = "Декабря";

"lng_weekday1" = "Пн";
"lng_weekday2" = "Вт";
"lng_weekday3" = "Ср";
"lng_weekday4" = "Чт";
"lng_weekday5" = "Пт";
"lng_weekday6" = "Сб";
"lng_weekday7" = "Вс";

"lng_weekday1_full" = "Понедельник";
"lng_weekday2_full" = "Вторник";
"lng_weekday3_full" = "Среда";
"lng_weekday4_full" = "Четверг";
"lng_weekday5_full" = "Пятница";
"lng_weekday6_full" = "Суббота";
"lng_weekday7_full" = "Воскресенье";

"lng_month_day" = "{day} {month}";
"lng_month_day_year" = "{day} {month}, {year}";

"lng_box_ok" = "OK";

"lng_cancel" = "Отмена";
"lng_continue" = "Продолжить";
"lng_close" = "Закрыть";
"lng_connecting" = "Подключение...";
"lng_reconnecting" = "Повторное подключение {count:сейчас|через # с|через # с}..";
"lng_reconnecting_try_now" = "Попробовать сейчас";

"lng_status_service_notifications" = "служебные уведомления";
"lng_status_support" = "поддержка";
"lng_status_bot" = "робот";
"lng_status_bot_reads_all" = "имеет доступ к сообщениям";
"lng_status_bot_not_reads_all" = "не имеет доступа к сообщениям";
"lng_status_offline" = "давно не заходил(-а)";
"lng_status_recently" = "заходил(-а) недавно";
"lng_status_last_week" = "заходил(-а) на неделе";
"lng_status_last_month" = "заходил(-а) в этом месяце";
"lng_status_invisible" = "невидимый";
"lng_status_lastseen_now" = "был(а) в сети только что";
"lng_status_lastseen_minutes" = "был(а) в сети {count:_not_used_|# минуту|# минут(-ы)} назад";
"lng_status_lastseen_hours" = "был(а) в сети {count:_not_used_|# час|# часа(-ов)} назад";
"lng_status_lastseen_today" = "был(а) в сети сегодня в {time}";
"lng_status_lastseen_yesterday" = "был(а) в сети вчера в {time}";
"lng_status_lastseen_date" = "был(а) в сети {date}";
"lng_status_lastseen_date_time" = "был(а) в сети {date} в {time}";
"lng_status_online" = "в сети";
"lng_status_connecting" = "подключение..";

"lng_chat_status_unaccessible" = "группа недоступна";
"lng_chat_status_members" = "{count:no members|# участник|# участников}";
"lng_chat_status_members_online" = "{count:_not_used_|# участник|# участников}, {count_online:_not_used_|# онлайн|# онлайн}";

"lng_channel_status" = "канал";

"lng_channel_members_link" = "{count:_not_used_|# участник »|Участников: #}";
"lng_channel_admins_link" = "{count:_not_used_|# администратор »|Администраторов: #}";

"lng_server_error" = "Ошибка сервера.";
"lng_flood_error" = "Слишком быстро. Пожалуйста, повторите попытку  позже.";
"lng_deleted" = "Неизвестный";
"lng_deleted_message" = "Удалённое сообщение";

"lng_intro" = "Добро пожаловать в официальное приложение [a href=\"https://tlgrm.ru/\"]Telegram[/a] для компьютера.\nОно очень [b]быстрое[/b] и [b]безопасное[/b].";
"lng_start_msgs" = "Начать общение";

"lng_intro_next" = "Дальше";
"lng_intro_finish" = "Зарегистрироваться";
"lng_intro_submit" = "Отправить";

"lng_photo_caption" = "Заголовок";

"lng_phone_ph" = "Ваш номер телефона";
"lng_phone_title" = "Ваш телефон";
"lng_phone_desc" = "Пожалуйста, подтвердите Ваш код страны и\nвведите Ваш номер телефона.";
"lng_phone_notreg" = "Если у вас нет аккаунта в Telegram,\nпожалуйста, [b]зарегистрируйтесь[/b] через приложение для [a href=\"https://telegram.org/\"]iOS / Android[/a] или {signup_start}здесь »{signup_end}";
"lng_country_code" = "Код страны";
"lng_bad_country_code" = "Некорректный код страны";
"lng_country_ph" = "Поиск";
"lng_country_done" = "Готово";
"lng_country_none" = "Страна не найдена";
"lng_country_select" = "Выберите страну";

"lng_code_ph" = "Ваш код";
"lng_code_desc" = "Мы отправили код доступа на ваш номер.\nПожалуйста, введите его в это поле.";
"lng_code_telegram" = "Введите код, который вы получили в [b]Telegram[/b] на другом устройстве";
"lng_code_no_telegram" = "Отправить код через SMS";
"lng_code_call" = "Telegram позвонит вам через {minutes}:{seconds}";
"lng_code_calling" = "Запрос вызова из Telegram..";
"lng_code_called" = "Telegram набирает номер";

"lng_bad_phone" = "Неверный номер телефона. Пожалуйста, попробуйте еще раз.";
"lng_bad_phone_noreg" = "Номер телефона не зарегистрирован.";
"lng_bad_code" = "Вы ввели неверный код.";
"lng_bad_name" = "Пожалуйста, введите Ваше имя и фамилию.";
"lng_bad_photo" = "Выбрано плохое изображение.";

"lng_bad_image_for_photo" = "Это изображение не может быть отправлено таким образом.\nОтправить его в виде файла?";

"lng_signin_title" = "Проверка пароля";
"lng_signin_desc" = "Введите пароль";
"lng_signin_recover_desc" = "Введите код, который мы отправили в e-mail.";
"lng_signin_password" = "Ваш пароль";
"lng_signin_code" = "Код, который мы отправили в e-mail";
"lng_signin_recover" = "Забыли пароль?";
"lng_signin_recover_title" = "Сбросить пароль";
"lng_signin_hint" = "Подсказка: {password_hint}";
"lng_signin_recover_hint" = "Код был отправлен на {recover_email}";
"lng_signin_bad_password" = "Вы ввели неверный пароль.";
"lng_signin_wrong_code" = "Вы ввели неверный код.";
"lng_signin_try_password" = "Нет доступа к почте?";
"lng_signin_password_removed" = "Защита паролем выключена. Вы можете выключить её в настройках.";
"lng_signin_no_email_forgot" = "Так как вы не указали адрес электронной почты для восстановления пароля, оставшиеся варианты — вспомнить пароль или сбросить аккаунт.";
"lng_signin_cant_email_forgot" = "Если вы не можете получить доступ к своей электронной почте, единственные доступные варианты — вспомнить пароль или сбросить аккаунт.";
"lng_signin_reset_account" = "Сбросить аккаунт";
"lng_signin_sure_reset" = "Внимание!\n\nИстория сообщений и чаты будут безвозвратно удалены. Продолжить?";
"lng_signin_reset" = "Сбросить";

"lng_signup_title" = "Информация и фото";
"lng_signup_desc" = "Пожалуйста, введите Ваше имя и\nзагрузите фотографию.";

"lng_signup_firstname" = "Имя";
"lng_signup_lastname" = "Фамилия";

"lng_dlg_filter" = "Поиск";
"lng_dlg_new_group_name" = "Название группы";
"lng_dlg_new_channel_name" = "Название канала";
"lng_no_contacts" = "У вас нет контактов";
"lng_no_chats" = "Ваши чаты будут здесь";
"lng_contacts_loading" = "Загрузка..";
"lng_contacts_not_found" = "Контакты не найдены";
"lng_dlg_search_chat" = "Поиск в этом чате";
"lng_dlg_search_for_messages" = "Поиск сообщений";

"lng_settings_save" = "Сохранить";
"lng_settings_upload" = "Обновить фото профиля";
"lng_settings_crop_profile" = "Выберите квадратную область для фото вашего профиля";
"lng_settings_uploading_photo" = "Загрузка фото..";

"lng_username_title" = "Имя пользователя";
"lng_username_about" = "Вы можете выбрать имя пользователя Telegram.\nКогда вы это сделаете, другие пользователи смогут найти\nвас по этому имени пользователя и связаться с вами,\nне зная ваш номер телефона.\n\nВы можете использовать A-Z, 0-9 и подчеркивания.\nМинимальная длина составляет 5 символов.";
"lng_username_choose" = "Выберите имя пользователя";
"lng_username_invalid" = "Некорректное имя пользователя.";
"lng_username_occupied" = "Это имя пользователя уже занято.";
"lng_username_too_short" = "Имя пользователя слишком короткое.";
"lng_username_bad_symbols" = "Вы ввели недопустимые символы.";
"lng_username_available" = "Доступно";
"lng_username_not_found" = "Пользователь @{user} не найден.";
"lng_username_link_willbe" = "Эта ссылка откроет диалог с вами:";
"lng_username_link" = "Эта ссылка открывает диалог с вами:";
"lng_username_copied" = "Ссылка скопирована в буфер обмена.";

"lng_settings_section_contact_info" = "Информация о контакте";
"lng_settings_phone_number" = "Номер:";
"lng_settings_username" = "Имя пользователя:";
"lng_settings_choose_username" = "выберите имя пользователя";

"lng_settings_section_notify" = "Уведомления";
"lng_settings_desktop_notify" = "Уведомления на рабочем столе";
"lng_settings_show_name" = "Показывать имя отправителя";
"lng_settings_show_preview" = "Показывать превью сообщения";
"lng_settings_use_windows" = "Использовать уведомления Windows";
"lng_settings_sound_notify" = "Звук";
"lng_settings_include_muted" = "Подсчитывать непрочитанные сообщения из всех чатов";

"lng_notification_preview" = "У вас новое сообщение";

"lng_settings_section_general" = "Общее";
"lng_settings_change_lang" = "Изменить язык";
"lng_languages" = "Языки";
"lng_sure_save_language" = "Telegram перезапустится,\nчтобы сменить язык.";
"lng_settings_auto_update" = "Обновлять автоматически";
"lng_settings_current_version" = "Версия {version}";
"lng_settings_check_now" = "Проверка обновлений";
"lng_settings_update_checking" = "Проверка обновлений..";
"lng_settings_latest_installed" = "Установлена самая последняя версия";
"lng_settings_downloading" = "Загружаю обновление: {ready} / {total} Мб..";
"lng_settings_update_ready" = "Обновление загружено";
"lng_settings_update_now" = "Перезапустить сейчас";
"lng_settings_update_fail" = "Проверка обновления не удалась :(";
"lng_settings_workmode_tray" = "Показывать иконку в трее";
"lng_settings_workmode_window" = "Показывать иконку в области задач";
"lng_settings_auto_start" = "Запускать Telegram при старте системы";
"lng_settings_start_min" = "Запускать свёрнутым";
"lng_settings_add_sendto" = "Добавить Telegram в меню «Отправить...»";
"lng_settings_scale_label" = "Масштаб интерфейса";
"lng_settings_scale_auto" = "Авто ({cur})";

"lng_settings_section_chat" = "Настройки чата";
"lng_settings_replace_emojis" = "Заменять смайлы";
"lng_settings_view_emojis" = "Просмотреть список";
"lng_settings_emoji_list" = "Доступные смайлы";
"lng_settings_send_enter" = "Отправлять по Enter";
"lng_settings_send_ctrlenter" = "Отправлять по Ctrl+Enter";
"lng_settings_send_cmdenter" = "Отправлять по Cmd+Enter";

"lng_settings_section_background" = "Фоновое изображение чата";
"lng_settings_bg_from_gallery" = "Выбрать из галереи";
"lng_settings_bg_from_file" = "Выбрать из файла";
"lng_settings_bg_tile" = "Замостить";

"lng_backgrounds_header" = "Выберите новый фон для чата";

"lng_download_path_dont_ask" = "Не спрашивать путь для сохранения";
"lng_download_path_label" = "Путь для сохранения:";
"lng_download_path_temp" = "временная папка";
"lng_download_path_default" = "папка по умолчанию";
"lng_download_path_clear" = "Очистить всё";
"lng_download_path_header" = "Выбрать путь для скачивания";
"lng_download_path_default_radio" = "Папка «Загрузки»";
"lng_download_path_temp_radio" = "Временная папка (очищается при выходе)";
"lng_download_path_dir_radio" = "Пользовательская  папка (очищается вручную)";
"lng_download_path_choose" = "Выберите путь для скачивания";
"lng_sure_clear_downloads" = "Очистить временную папку с загрузками? Это происходит автоматически при выходе из аккаунта или удалении программы.";
"lng_download_path_failed" = "Загрузку файла невозможно запустить. Это могло произойти из-за невозможности сохранить файл в папке по умолчанию.\n\nВы можете изменить расположение папки по умолчанию в Настройках.";
"lng_download_path_settings" = "Настройки";
"lng_download_finish_failed" = "Загрузка файла не может быть завершена.\n\nПопробовать еще раз?";
"lng_download_path_clearing" = "Очистка...";
"lng_download_path_cleared" = "Очищено!";
"lng_download_path_clear_failed" = "Очистка  не удалась :(";

"lng_settings_section_cache" = "Локальное хранилище";
"lng_settings_no_data_cached" = "Кэш пуст!";
"lng_settings_images_cached" = "Изображений: {count:_not_used_|# |# } ({size})";
"lng_settings_audios_cached" = "Аудиофайлов: {count:_not_used_|# |# } ({size})";
"lng_local_storage_clear" = "Очистить кэш ";
"lng_local_storage_clearing" = "Очистка...";
"lng_local_storage_cleared" = "Очищено!";
"lng_local_storage_clear_failed" = "Не получилось очистить кэш :(";

"lng_settings_section_advanced" = "Расширенные настройки";

"lng_passcode_remove_button" = "Удалить";

"lng_passcode_turn_on" = "Включить блокировку кодом доступа";
"lng_passcode_change" = "Изменить код доступа";
"lng_passcode_create" = "Код доступа";
"lng_passcode_remove" = "Удалить код доступа";
"lng_passcode_turn_off" = "Выключить блокировку паролем";
"lng_passcode_autolock" = "Автоблокировка";
"lng_passcode_autolock_away" = "Блокировать при отсутствии в течение: ";
"lng_passcode_autolock_inactive" = "Блокировать при отсутствии активности в течение:";
"lng_passcode_autolock_minutes" = "{count:_not_used_|# минуты|# минут}";
"lng_passcode_autolock_hours" = "{count:_not_used_|# часа|# часов}";
"lng_passcode_enter_old" = "Введите код доступа";
"lng_passcode_enter_first" = "Введите код доступа";
"lng_passcode_enter_new" = "Введите новый пароль";
"lng_passcode_confirm_new" = "Повторите ввод пароля";
"lng_passcode_about" = "После установки кода доступа в правом верхнем углу появится замочек. Нажмите на него, чтобы заблокировать приложение.\n\nВажно: если вы забудете код доступа, вам придётся войти в приложение заново.";
"lng_passcode_differ" = "Пароли не совпадают";
"lng_passcode_wrong" = "Неверный пароль";
"lng_passcode_is_same" = "Пароль не был изменён";
"lng_passcode_enter" = "Введите ваш код доступа";
"lng_passcode_submit" = "Разблокировать";
"lng_passcode_logout" = "Выйти из аккаунта";

"lng_cloud_password_waiting" = "Ссылка для подтверждения была отправлена на {email}";
"lng_cloud_password_change" = "Сменить пароль";
"lng_cloud_password_create" = "Пароль";
"lng_cloud_password_remove" = "Удалить пароль";
"lng_cloud_password_set" = "Включить двухэтапную авторизацию";
"lng_cloud_password_edit" = "Сменить пароль";
"lng_cloud_password_enter_old" = "Введите текущий пароль";
"lng_cloud_password_enter_first" = "Введите пароль";
"lng_cloud_password_enter_new" = "Введите новый пароль";
"lng_cloud_password_confirm_new" = "Повторите ввод пароля";
"lng_cloud_password_hint" = "Подсказка к паролю";
"lng_cloud_password_change_hint" = "Введите подсказку к паролю";
"lng_cloud_password_bad" = "Вы не можете использовать сам пароль как подсказку.";
"lng_cloud_password_email" = "Резервный e-mail";
"lng_cloud_password_bad_email" = "Неверный адрес электронной почты, пожалуйста, попробуйте другой.";
"lng_cloud_password_about" = "Этот пароль будет требоваться при входе на новом устройстве в дополнение к ПИН-коду.";
"lng_cloud_password_about_recover" = "Вы уверены?\n\nЕсли вы забудете пароль, восстановить доступ к аккаунту будет невозможно. Ещё раз: вы навсегда потеряете доступ к своему аккаунту.";
"lng_cloud_password_skip_email" = "Не добавлять e-mail";
"lng_cloud_password_almost" = "Ссылка для подтверждения почты была отправлена на указанный адрес.\nДвухступенчатая авторизация будет активирована после того, как вы перейдете по этой ссылке.";
"lng_cloud_password_was_set" = "Двухэтапная авторизация включена.";
"lng_cloud_password_updated" = "Ваш пароль обновлён.";
"lng_cloud_password_removed" = "Двухэтапная авторизация выключена.";
"lng_cloud_password_differ" = "Пароли не совпадают";
"lng_cloud_password_wrong" = "Неверный пароль";
"lng_cloud_password_is_same" = "Пароль не был изменён";

"lng_connection_type" = "Тип соединения:";
"lng_connection_auto_connecting" = "По умолчанию (подключение...)";
"lng_connection_auto" = "По умолчанию (сейчас: {transport})";
"lng_connection_proxy_connecting" = "Подключение через прокси...";
"lng_connection_proxy" = "{transport} с прокси";
"lng_connection_header" = "Тип соединения";
"lng_connection_auto_rb" = "Автоматически (приоритет TCP)";
"lng_connection_http_proxy_rb" = "HTTP с нестандартным http-прокси";
"lng_connection_tcp_proxy_rb" = "TCP с нестандартным socks5-прокси";
"lng_connection_try_ipv6" = "Подключиться по IPv6";
"lng_connection_host_ph" = "Хост";
"lng_connection_port_ph" = "Порт";
"lng_connection_user_ph" = "Логин";
"lng_connection_password_ph" = "Пароль";
"lng_connection_save" = "Сохранить";
"lng_settings_show_sessions" = "Показать все сессии";
"lng_settings_reset" = "Завершить все сессии";
"lng_settings_reset_sure" = "Уверены, что хотите завершить все другие сессии?";
"lng_settings_reset_one_sure" = "Завершить эту сессию?";
"lng_settings_reset_button" = "Завершить";
"lng_settings_reset_done" = "Все сессии завершены";
"lng_settings_ask_question" = "Задать вопрос";
"lng_settings_ask_sure" = "Поддержка Телеграма осуществляется добровольцами. Мы постараемся ответить как можно скорее, но на это может потребоваться некоторое время.\n\nВы также можете ознакомиться с ответами на популярные вопросы о Телеграме, где есть советы по решению многих проблем.";
"lng_settings_faq_button" = "Перейти в FAQ";
"lng_settings_ask_ok" = "Спросить";
"lng_settings_faq" = "Часто задаваемые вопросы";
"lng_settings_logout" = "Выйти";
"lng_sure_logout" = "Вы действительно хотите выйти?";

"lng_settings_need_restart" = "Необходимо перезапустить Telegram для применения некоторых настроек. Сделать это сейчас?";
"lng_settings_restart_now" = "ПЕРЕЗАПУСТИТЬ";
"lng_settings_restart_later" = "ПОЗЖЕ";

"lng_sessions_header" = "Текущая сессия";
"lng_sessions_other_header" = "Активные сесии";
"lng_sessions_no_other" = "Нет других сессий";
"lng_sessions_other_desc" = "Вы можете войти в Telegram с любого устройства: телефона, планшета или компьютер, используя ваш номер телефона. Все контакты и история сообщений будут мгновенно синхронизироваться.";
"lng_sessions_terminate_all" = "Завершить все сеансы";

"lng_preview_loading" = "Получаю информацию о ссылке...";

"lng_profile_chat_unaccessible" = "Группа недоступна";
"lng_topbar_info" = "Информация";
"lng_profile_about_section" = "О роботе";
"lng_profile_description_section" = "Описание";
"lng_profile_settings_section" = "Настройки";
"lng_profile_actions_section" = "Действия";
"lng_profile_bot_settings" = "Настройки";
"lng_profile_bot_help" = "Помощь";
"lng_profile_create_public_link" = "Создать пригласительную ссылку";
"lng_profile_edit_public_link" = "Редактировать ссылку на профиль";
"lng_profile_participants_section" = "Участники";
"lng_profile_info" = "Информация о контакте";
"lng_profile_group_info" = "Информация о группе";
"lng_profile_channel_info" = "О канале";
"lng_profile_add_contact" = "Добавить контакт";
"lng_profile_edit_contact" = "Редактировать";
"lng_profile_enable_notifications" = "Показывать уведомления";
"lng_profile_clear_history" = "Очистить историю";
"lng_profile_delete_conversation" = "Удалить диалог";
"lng_profile_clear_and_exit" = "Удалить и выйти";
"lng_profile_leave_channel" = "Покинуть канал";
"lng_profile_delete_channel" = "Удалить канал";
"lng_profile_search_messages" = "Поиск сообщений";
"lng_profile_block_user" = "Заблокировать пользователя";
"lng_profile_unblock_user" = "Разблокировать пользователя";
"lng_profile_block_bot" = "Остановить и заблокировать";
"lng_profile_unblock_bot" = "Разблокировать робота";
"lng_profile_send_message" = "Написать";
"lng_profile_share_contact" = "Отправить контакт";
"lng_profile_invite_to_group" = "Добавить в группу";
"lng_profile_delete_contact" = "Удалить";
"lng_profile_set_group_photo" = "Выбрать фото";
"lng_profile_add_participant" = "Добавить участников";
"lng_profile_delete_and_exit" = "Покинуть";
"lng_profile_kick" = "Удалить";
"lng_profile_sure_kick" = "Исключить {user} из группы?";
"lng_profile_sure_kick_channel" = "Исключить {user} из канала?";
"lng_profile_sure_kick_admin" = "Разжаловать {user} из администраторов?";
"lng_profile_loading" = "Загрузка..";
"lng_profile_shared_media" = "Общие файлы";
"lng_profile_no_media" = "В истории сообщений нет файлов.";
"lng_profile_photos" = "{count:_not_used_|# фотография|Фотографий: #}";
"lng_profile_photos_header" = "Просмотр фотографий";
"lng_profile_videos" = "Видеозаписей: {count:_not_used_|# |# }";
"lng_profile_videos_header" = "Просмотр видео";
"lng_profile_files" = "{count:_not_used_|# файл|Файлов: #}";
"lng_profile_files_header" = "Просмотр файлов";
"lng_profile_audios" = "{count:_not_used_|# аудиозапись|Аудиозаписей: #}";
"lng_profile_audios_header" = "Обзор аудиозаписей";
"lng_profile_shared_links" = "{count:_not_used_|# ссылка |Ссылок: #}";
"lng_profile_shared_links_header" = "Все ссылки";
"lng_profile_audio_files_header" = "Плейлист";
"lng_profile_copy_phone" = "Скопировать номер";

"lng_channel_add_admins" = "Добавить администратора";
"lng_channel_add_members" = "Добавить участников";
"lng_channel_members" = "Участники";
"lng_channel_admins" = "Администраторы";
"lng_channel_add_admin" = "Добавить администратора";
"lng_channel_admin_sure" = "Сделать {user} администратором?";

"lng_participant_filter" = "Поиск";
"lng_participant_invite" = "Пригласить";
"lng_participant_invite_sorry" = "К сожалению, вручную можно добавить только первых {count} пользователей.\n\nДля того, чтобы пригласить больше людей, воспользуйтесь пригласительной ссылкой.";
"lng_create_group_back" = "Назад";
"lng_create_group_next" = "Далее";
"lng_create_group_create" = "Создать";
"lng_create_group_title" = "Создать группу";
"lng_create_group_about" = "Группы идеально подходят для маленьких сообществ – вплоть до {count} участников";
"lng_create_channel_title" = "Создать канал";
"lng_create_channel_about" = "Каналы – это инструмент для вещания ваших сообщений неограниченному числу пользователей";
"lng_create_public_channel_title" = "Публичный канал";
"lng_create_public_channel_about" = "Канал отображается в поиске, присоединиться может кто угодно";
"lng_create_private_channel_title" = "Приватный канал";
"lng_create_private_channel_about" = "Присоединиться можно только по специальной ссылке";
"lng_create_channel_comments" = "Включить комментарии";
"lng_create_channel_comments_about" = "Если вы включите комментарии, люди смогут обсуждать ваши сообщения на канале.";
"lng_create_group_skip" = "Пропустить";

"lng_create_channel_link_invalid" = "Некорректная ссылка";
"lng_create_channel_link_occupied" = "К сожалению, эта ссылка уже занята";
"lng_create_channel_link_too_short" = "Слишком короткое имя.";
"lng_create_channel_link_bad_symbols" = "Ссылка содержит недопустимые символы.";
"lng_create_channel_link_available" = "Это имя доступно";
"lng_create_channel_link_copied" = "Ссылка скопирована в буфер обмена";

"lng_create_group_crop" = "Выберите квадратную область для фото группы";
"lng_create_channel_crop" = "Выберите квадратную область для фото канала";

"lng_failed_add_participant" = "Не получилось добавить пользователя. Повторите попытку позже.";
"lng_failed_add_not_mutual" = "К сожалению, если пользователь покинул группу, \nто вернуть его можно будет только при условии, \nчто вы находитесь в контактах друг у друга \n(у него есть ваш номер, а у вас — его).";
"lng_failed_add_not_mutual_channel" = "К сожалению, если пользователь покинул канал, \nто вернуть его можно будет только при условии, \nчто вы находитесь в контактах друг у друга \n(у него есть ваш номер, а у вас — его).";

"lng_sure_delete_contact" = "Вы уверены, что хотите удалить из контактов {contact}?";
"lng_sure_delete_history" = "Вы уверены, что хотите удалить историю сообщений с {contact}?\n\nВосстановить сообщения будет невозможно.";
"lng_sure_delete_group_history" = "Вы уверены, что хотите удалить историю сообщений в «{group}»?\n\nЭто действие нельзя будет отменить.";
"lng_sure_delete_and_exit" = "Вы уверены, что хотите удалить историю сообщений и покинуть «{group}»?\n\nЭто действие нельзя будет отменить";
"lng_sure_leave_channel" = "Уверены, что хотите покинуть этот канал?";
"lng_sure_delete_channel" = "Уверены, что хотите удалить этот канал? Все участники и сообщения будут безвозвратно удалены.";

"lng_message_empty" = "Пустое сообщение";
"lng_media_unsupported" = "Неподдерживаемый файл";

"lng_action_add_user" = "{from} добавил(а) {user}";
"lng_action_add_you" = "{from} добавил(а) вас на этот канал";
"lng_action_you_joined" = "Вы присоединились к каналу";
"lng_action_kick_user" = "{from} исключил(а) {user}";
"lng_action_user_left" = "{from} покинул(а) группу";
"lng_action_user_joined" = "пользователь {from} присоединился к группе";
"lng_action_user_joined_by_link" = "{from} присоединился к группе по пригласительной ссылке";
"lng_action_user_registered" = "{from} присоединился к Telegram";
"lng_action_removed_photo" = "{from} удалил(а) фото группы";
"lng_action_removed_photo_channel" = "Фото канала удалено";
"lng_action_changed_photo" = "{from} изменил(а) фото группы";
"lng_action_changed_photo_channel" = "Фото обновлено";
"lng_action_changed_title" = "{from} изменил(а) название группы на «{title}»";
"lng_action_changed_title_channel" = "Имя канала изменено на «{title}»";
"lng_action_created_chat" = "{from} создал(а) группу «{title}»";
"lng_action_created_channel" = "Канал «{title}» создан";

"lng_channel_comments_count" = "{count:_not_used_|Комментариев: #|Комментариев: #}";
"lng_channel_hide_comments" = "Скрыть комментарии";
"lng_channel_not_accessible" = "К сожалению, этот канал больше недоступен.";

"lng_channels_too_much_public_existing" = "К сожалению, вы создали слишком много публичных каналов. Пожалуйста, удалите один из них, чтобы создать новый.";
"lng_channels_too_much_public" = "К сожалению, вы создали слишком много публичных каналов.\n\nВы можете либо удалить один из существующих, либо создать приватный канал.";

"lng_group_invite_bad_link" = "Ссылка некорректна или просрочена.";
"lng_group_invite_want_join" = "Войти в группу «{title}»?";
"lng_group_invite_want_join_channel" = "Присоединиться к каналу «{title}»?";
"lng_group_invite_join" = "Присоединиться";

"lng_group_invite_link" = "Ссылка для приглашения:";
"lng_group_invite_create" = "Создать ссылку приглашения";
"lng_group_invite_about" = "Любой пользователь Telegram сможет вступить в вашу группу, перейдя по этой ссылке.";
"lng_group_invite_create_new" = "Отозвать ссылку";
"lng_group_invite_about_new" = "Предыдущая ссылка деактивирована,\nсейчас будет создана новая.";
"lng_group_invite_copied" = "Скопировано";
"lng_group_invite_no_room" = "Невозможно присоединиться к этой группе – в ней уже слишком много участников.";

"lng_channel_public_link_copied" = "Ссылка скопирована в буфер обмена.";

"lng_forwarded_from" = "Переслано от";
"lng_in_reply_to" = "В ответ на";

"lng_attach_failed" = "Неудачно";
"lng_attach_file" = "Файл";
"lng_attach_photo" = "Фото";

"lng_media_type" = "Тип файла";
"lng_media_type_photos" = "Фото";
"lng_media_type_videos" = "Видео";
"lng_media_type_files" = "Файлы";
"lng_media_type_audios" = "Аудиозаписи";
"lng_media_type_links" = "Общие ссылки";

"lng_media_open_with" = "Открыть с помощью";
"lng_media_download" = "Скачать";
"lng_media_cancel" = "Отмена";
"lng_media_video" = "Видео";
"lng_media_audio" = "Аудиозапись";

"lng_emoji_category0" = "Часто используемые";
"lng_emoji_category1" = "Люди";
"lng_emoji_category2" = "Природа";
"lng_emoji_category3" = "Еда и напитки";
"lng_emoji_category4" = "Праздник";
"lng_emoji_category5" = "Активность";
"lng_emoji_category6" = "Путешествия и местности";
"lng_emoji_category7" = "Объекты и символы";

"lng_switch_stickers" = "Стикеры";
"lng_switch_emoji" = "Эмодзи";

"lng_box_remove" = "Удалить";

"lng_custom_stickers" = "Пользовательские стикеры";
"lng_stickers_remove_pack" = "Удалить «{sticker_pack}»?";
"lng_stickers_add_pack" = "Установить стикеры";
"lng_stickers_share_pack" = "Поделиться стикерами";
"lng_stickers_not_found" = "Стикеры не найдены";
"lng_stickers_copied" = "Скопировано";
"lng_stickers_default_set" = "Великие умы";

"lng_in_dlg_photo" = "Фото";
"lng_in_dlg_video" = "Видео";
"lng_in_dlg_contact" = "Контакт";
"lng_in_dlg_audio" = "Аудиозапись";
"lng_in_dlg_file" = "Файл";
"lng_in_dlg_sticker" = "Стикер";
"lng_in_dlg_sticker_emoji" = "{emoji} (стикер)";

"lng_report_spam" = "Сообщить о спаме";
"lng_report_spam_hide" = "Скрыть";
"lng_report_spam_thanks" = "Спасибо за сообщение!";
"lng_report_spam_sure" = "Уверены, что хотите сообщить о спаме от этого пользователя?";
"lng_report_spam_sure_group" = "Уверены, что хотите сообщить о спаме от этой группы?";
"lng_report_spam_sure_channel" = "Уверены, что хотите сообщить о спаме от этого канала?";
"lng_report_spam_ok" = "Сообщить";
"lng_cant_send_to_not_contact" = "К сожалению, вы можете отправлять сообщения только взаимным контактам. {more_info}";
"lng_cant_invite_not_contact" = "К сожалению, вы можете добавлять в группы только взаимные контакты. {more_info}";
"lng_cant_invite_not_contact_channel" = "К сожалению, вы можете добавлять в каналы только взаимные контакты. {more_info}";
"lng_cant_more_info" = "Подробнее »";

"lng_send_button" = "Отправить";
"lng_message_ph" = "Наберите ваше сообщение..";
"lng_comment_ph" = "Комментировать..";
"lng_broadcast_ph" = "Опубликовать сообщение...";
"lng_record_cancel" = "Отпустите вне этого поля для отмены";
"lng_empty_history" = "";
"lng_willbe_history" = "Выберите чат";
"lng_message_with_from" = "[c]{from}:[/c] {message}";
"lng_from_you" = "Вы";
"lng_bot_description" = "Что может этот робот?";
"lng_unblock_button" = "Разблокировать";
"lng_channel_join" = "Присоединиться";
"lng_channel_mute" = "Выкл. звук";
"lng_channel_unmute" = "Вкл. звук";

"lng_open_this_link" = "Открыть ссылку?";
"lng_open_link" = "Открыть";

"lng_bot_start" = "Начать";
"lng_bot_choose_group" = "Выберите группу";
"lng_bot_no_groups" = "У вас нет групп";
"lng_bot_groups_not_found" = "Группы не найдены";
"lng_bot_sure_invite" = "Добавить робота в «{group}»?";
"lng_bot_already_in_group" = "Робот уже состоит в указанной группе.";

"lng_typing" = "печатает";
"lng_user_typing" = "{user} печатает";
"lng_users_typing" = "{user} и {second_user} печатают";
"lng_many_typing" = "{count:_not_used_|# |# } печатают";
"lng_send_action_record_video" = "записывает видео";
"lng_user_action_record_video" = "{user} записывает видео";
"lng_send_action_upload_video" = "отправляет видео";
"lng_user_action_upload_video" = "{user} отправляет видео";
"lng_send_action_record_audio" = "записывает аудио";
"lng_user_action_record_audio" = "{user} записывает аудио";
"lng_send_action_upload_audio" = "отправляет аудио";
"lng_user_action_upload_audio" = "{user} отправляет аудио";
"lng_send_action_upload_photo" = "отправляет фото";
"lng_user_action_upload_photo" = "{user} отправляет фото";
"lng_send_action_upload_file" = "отправляет файл";
"lng_user_action_upload_file" = "{user} отправляет файл";
"lng_send_action_geo_location" = "определяет местоположение";
"lng_user_action_geo_location" = "{user} определяет местоположение";
"lng_send_action_choose_contact" = "выбирает контакт";
"lng_user_action_choose_contact" = "{user} выбирает контакт";
"lng_unread_bar" = "{count:_not_used_|# непрочитанное сообщение|Непрочитанных сообщений: # }";

"lng_maps_point" = "Местоположение";
"lng_save_photo" = "Сохранить изображение";
"lng_save_video" = "Сохранить видео";
"lng_save_audio" = "Сохранить аудиозапись";
"lng_save_file" = "Сохранить файл";
"lng_save_downloaded" = "{ready} / {total} {mb}";
"lng_duration_and_size" = "{duration}, {size}";
"lng_choose_images" = "Выбрать изображения";

"lng_context_open_link" = "Открыть ссылку";
"lng_context_copy_link" = "Копировать ссылку";
"lng_context_open_email" = "Написать на этот адрес";
"lng_context_copy_email" = "Копировать адрес";
"lng_context_open_hashtag" = "Поиск по хэштегу";
"lng_context_copy_hashtag" = "Скопировать хэштег";
"lng_context_open_mention" = "Открыть профиль";
"lng_context_copy_mention" = "Скопировать имя пользователя";
"lng_context_open_image" = "Открыть изображение";
"lng_context_save_image" = "Сохранить изображение как..";
"lng_context_forward_image" = "Переслать изображение";
"lng_context_delete_image" = "Удалить изображение";
"lng_context_copy_image" = "Копировать изображение";
"lng_context_close_image" = "Закрыть изображение";
"lng_context_cancel_download" = "Отменить загрузку";
"lng_context_show_in_folder" = "Показать в папке";
"lng_context_show_in_finder" = "Показать в Finder";
"lng_context_open_video" = "Открыть видео";
"lng_context_save_video" = "Сохранить как...";
"lng_context_open_audio" = "Открыть";
"lng_context_save_audio" = "Сохранить как...";
"lng_context_pack_info" = "Весь набор";
"lng_context_pack_add" = "Добавить стикеры";
"lng_context_open_file" = "Открыть файл";
"lng_context_save_file" = "Сохранить как...";
"lng_context_forward_file" = "Переслать файл";
"lng_context_delete_file" = "Удалить файл";
"lng_context_close_file" = "Закрыть файл";
"lng_context_copy_text" = "Скопировать текст";
"lng_context_to_msg" = "Перейти к сообщению";
"lng_context_reply_msg" = "Ответить";
"lng_context_forward_msg" = "Переслать сообщение";
"lng_context_delete_msg" = "Удалить сообщение";
"lng_context_select_msg" = "Выделить сообщение";
"lng_context_cancel_upload" = "Отменить отправку";
"lng_context_copy_selected" = "Копировать выделенное";
"lng_context_forward_selected" = "Переслать выделенные";
"lng_context_delete_selected" = "Удалить выделенные";
"lng_context_clear_selection" = "Снять выделение";
"lng_really_send_image" = "Отправить этот файл?";
"lng_really_send_file" = "Отправить этот файл?";
"lng_really_share_contact" = "Вы действительно хотите поделиться этим контактом?";
"lng_send_image_compressed" = "Сжать отправляемое изображение";

"lng_forward_choose" = "Выберите получателя..";
"lng_forward_cant" = "К сожалению, сюда нельзя пересылать сообщения :(";
"lng_forward_confirm" = "Переслать пользователю {recipient}?";
"lng_forward_share_contact" = "Поделиться контактом с {recipient}?";
"lng_forward_send_file_confirm" = "Отправить «{name}» пользователю {recipient}?";
"lng_forward_send_files_confirm" = "Отправить файлы {recipient}?";
"lng_forward_send" = "Отправить";
"lng_forward_messages" = "{count:_not_used_|Пересланное сообщение|Пересланных сообщений: #}";
"lng_forwarding_from" = "{user} и еще {count:_not_used_|# |# }";
"lng_forwarding_from_two" = "{user} и {second_user}";

"lng_contact_phone" = "Телефон";
"lng_enter_contact_data" = "Новый контакт";
"lng_edit_group_title" = "Изменить имя группы";
"lng_edit_contact_title" = "Редактирование имени контакта";
"lng_edit_channel_title" = "Редактировать";
"lng_edit_self_title" = "Редактирование вашего имени";
"lng_confirm_contact_data" = "Новый контакт";
"lng_add_contact" = "Создать";
"lng_add_contact_button" = "Новый контакт";
"lng_contacts_header" = "Контакты";
"lng_contact_not_joined" = "К сожалению, {name} не подключен к Telegram, но Вы можете отправить ему приглашение.\n\nМы сообщим Вам, если кто-либо из Ваших контактов присоединится к Telegram.";
"lng_try_other_contact" = "Попробуйте другие";
"lng_create_group_link" = "Ссылка";
"lng_create_group_invite_link" = "Ссылка для приглашения";
"lng_create_group_photo" = "Выбрать фото";
"lng_create_group_description" = "Описание (не обязательно)";

"lng_drag_images_here" = "Перетащите изображения сюда";
"lng_drag_photos_here" = "Перетащите фотографии сюда";
"lng_drag_files_here" = "Перетащите файлы сюда";

"lng_drag_to_send_quick" = ", чтобы отправить их";
"lng_drag_to_send_no_compression" = ", чтобы отправить их без сжатия";
"lng_drag_to_send_files" = ", чтобы отправить их в виде файлов";

"lng_selected_clear" = "Отмена";
"lng_selected_delete" = "Удалить";
"lng_selected_forward" = "Переслать";
"lng_selected_count" = "Сообщений: {count:_not_used_|#  |#  }";
"lng_selected_cancel_sure_this" = "Отменить отправку файла?";
"lng_selected_delete_sure_this" = "Удалить это сообщение?";
"lng_selected_delete_sure" = "Удалить выбранные сообщения ({count:_not_used_|# |# })?";
"lng_box_delete" = "Удалить";
"lng_box_leave" = "Покинуть";

"lng_about_version" = "Версия {version}";
"lng_about_text_1" = "Official free messaging app based on [a href=\"https://core.telegram.org/api\"]Telegram API[/a]\nfor speed and security";
"lng_about_text_2" = "This software is licensed under [a href=\"https://github.com/telegramdesktop/tdesktop/blob/master/LICENSE\"]GNU GPL[/a] version 3.\nSource code is available on [a href=\"https://github.com/telegramdesktop/tdesktop\"]GitHub[/a].";
"lng_about_text_3" = "Visit {faq_open}Telegram FAQ{faq_close} for more info.";
"lng_about_done" = "Закрыть";

"lng_search_found_results" = "{count:Ничего не найдено|Найдено # сообщение|Найдено сообщений: #}";
"lng_search_global_results" = "Результаты глобального поиска";

"lng_media_save_progress" = "{ready} из {total} {mb}";
"lng_mediaview_save_as" = "Сохранить как...";
"lng_mediaview_copy" = "Скопировать";
"lng_mediaview_forward" = "Переслать";
"lng_mediaview_delete" = "Удалить";
"lng_mediaview_photos_all" = "Просмотр всех фото";
"lng_mediaview_files_all" = "Просмотр всех файлов";
"lng_mediaview_single_photo" = "Фото";
"lng_mediaview_group_photo" = "Фото группы";
"lng_mediaview_channel_photo" = "Фото канала";
"lng_mediaview_profile_photo" = "Фото профиля";
"lng_mediaview_file_n_of_count" = "{file} {n} из {count}";
"lng_mediaview_n_of_count" = "Фото {n} из {count}";
"lng_mediaview_doc_image" = "Файл";
"lng_mediaview_today" = "сегодня в {time}";
"lng_mediaview_yesterday" = "вчера в {time}";
"lng_mediaview_date_time" = "{date} в {time}";

"lng_mediaview_saved" = "Изображение было сохранено в папке [c]Загрузки[/c]";

"lng_new_authorization" = "{name},\nМы обнаружили вход под вашим аккаунтом на новом устройстве.\n\nДата: {day}, {date}\nВремя: {time}\nУстройство: {device}\nМестоположение: {location}\n\nЕсли это были не вы, можете перейти в Настройки — Приватность и безопасность — Завершить все другие сеансы.\n\nИскренне ваша, команда Telegram.";

"lng_new_version_wrap" = "Telegram Desktop был обновлён до версии {version}\n\n{changes}\n\nПолная история изменений доступна здесь:\n{link}";
"lng_new_version_minor" = "— Исправления багов и незначительные улучшения";
"lng_new_version_text" = "— Improved speed\n— First steps towards a new design";

"lng_menu_insert_unicode" = "Вставьте управляющий символ Unicode";

"lng_full_name" = "{first_name} {last_name}";

// Wnd specific

"lng_wnd_choose_program_menu" = "Выбрать программу по умолчанию...";

"lng_wnd_menu_undo" = "Отменить";
"lng_wnd_menu_redo" = "Повторить";

// Linux specific

"lng_linux_menu_undo" = "Отменить";
"lng_linux_menu_redo" = "Повторить";

// Mac specific

"lng_mac_choose_program_menu" = "Другое...";

"lng_mac_choose_app" = "Выберите программу";
"lng_mac_choose_text" = "Выберите программу для открытия документа \"{file}\".";
"lng_mac_enable_filter" = "Включить:";
"lng_mac_recommended_apps" = "Рекомендованные программы";
"lng_mac_all_apps" = "Все программы";
"lng_mac_always_open_with" = "Всегда открывать с помощью";
"lng_mac_this_app_can_open" = "Эта программа может открыть \"{file}\".";
"lng_mac_not_known_app" = "Неизвестно, сможет ли открыть эта программа \"{file}\".";

"lng_mac_menu_services" = "Сервисы";
"lng_mac_menu_hide_telegram" = "Скрыть {telegram}";
"lng_mac_menu_hide_others" = "Скрыть остальное";
"lng_mac_menu_show_all" = "Показать всё";
"lng_mac_menu_preferences" = "Настройки...";
"lng_mac_menu_quit_telegram" = "Выйти из {telegram}";
"lng_mac_menu_about_telegram" = "О программе";
"lng_mac_menu_file" = "Файл";
"lng_mac_menu_logout" = "Выйти";
"lng_mac_menu_edit" = "Правка";
"lng_mac_menu_undo" = "Отменить";
"lng_mac_menu_redo" = "Вернуть";
"lng_mac_menu_cut" = "Вырезать";
"lng_mac_menu_copy" = "Копировать";
"lng_mac_menu_paste" = "Вставить";
"lng_mac_menu_delete" = "Удалить";
"lng_mac_menu_select_all" = "Выделить все";
"lng_mac_menu_window" = "Окно";
"lng_mac_menu_contacts" = "Контакты";
"lng_mac_menu_add_contact" = "Добавить контакт";
"lng_mac_menu_new_group" = "Новая группа";
"lng_mac_menu_new_channel" = "Создать канал";
"lng_mac_menu_show" = "Показать Telegram";

"lng_settings_chat_style_1" = "Chat style 1";
"lng_settings_chat_style_2" = "Chat style 2";
"lng_settings_chat_style_3" = "Chat style 3";
"lng_settings_chat_style_4" = "Chat style 4";
// Keys finished
